// Основной заголовочный файл библиотеки.
// lwml, (c) ltwood

// Light Wood Math Library -- lwml(tm)
// (c) ltwood, 1993--2004
// (c) Light Wood Design Group
// Light Wood Numerical Solutions (tm)

// Базовый заголовочный файл для консольных приложений, использующих библиотеку lwml.
// Этот файл включает наиболее часто используемые заголовочные файлы библиотеки.
// В простых случаях для использования библиотеки lwml достаточно включить
// этот заголовочный файл.
// Более специфичные средства требуют индивидуального включения заголовочных
// файлов, в которых они определены.
// При включении этого файла средства консольного ввода-вывода и работы с файлами
// конфигурации подключаются по умолчанию.

#ifndef _LWML_
#define _LWML_

#include "defs.h"            // общие определения
#include "mdefs.h"           // математические определения
#include "stdmem.h"          // работа с памятью
#include "basex.h"           // обработка ошибок
#include "console.h"         // работа с консолью
#include "config.h"          // файлы конфигурации
#include "debug.h"

/*#lake:stop*/

#endif // _LWML_
